# HANDLING DUPLICATES

In [1]:
import pandas as pd

In [8]:
user_cols=["user_id","age","gender","occupation","zip_code"]
user=pd.read_table("pandas-videos-master/data/u.user",sep="|",header=None,names=user_cols)
user.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

In [20]:
user.shape

(943, 4)

In [21]:
user.set_index("user_id",inplace=True)
user.head()

KeyError: "None of ['user_id'] are in the columns"

## BOOLEANS OF DUPLICATES OF ZIPCODE. TRUE TELLS THAT THERE IS A SAME DATA ABOVE IT

In [22]:
user.zip_code.duplicated()

user_id
1      False
2      False
3      False
4      False
5      False
       ...
939    False
940     True
941    False
942    False
943    False
Name: zip_code, Length: 943, dtype: bool

## FINDING TOTAL NUMBER OF DUPLICATES

In [23]:
user.zip_code.duplicated().sum()

148

## FINDING NUMBER OF DUPLICATED ROWS

In [24]:
user.duplicated().sum()

7

### FILTERING ROWS

In [25]:
dupl=user.loc[user.duplicated(keep=False),:]
dupl

         age gender occupation zip_code
user_id
67        17      M    student    60402
85        51      M   educator    20003
198       21      F    student    55414
350       32      M    student    97301
428       28      M    student    55414
437       27      F      other    20009
460       44      F      other    60630
496       21      F    student    55414
572       51      M   educator    20003
621       17      M    student    60402
684       28      M    student    55414
733       44      F      other    60630
805       27      F      other    20009
890       32      M    student    97301

## FILTERING DUPLICATES ON THE BASIS OF CHOOSEN COLUMNS

In [29]:
user.duplicated(subset=["zip_code","age"]).sum()

16

### DROPPING DUPLICATES

In [26]:
dupl.head()

         age gender occupation zip_code
user_id
67        17      M    student    60402
85        51      M   educator    20003
198       21      F    student    55414
350       32      M    student    97301
428       28      M    student    55414

In [27]:
user.drop_duplicates(keep=False)

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
...      ...    ...            ...      ...
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

[929 rows x 4 columns]